&НаКлиенте
Процедура ТаблицаЗаявкаДатаНачалаПриИзменении(Элемент)
	КонтрольКорректностиПериода();	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаявкаДатаОкончанияПриИзменении(Элемент)
	КонтрольКорректностиПериода();	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольКорректностиПериода()
	ТекущиеДанные = Элементы.ТаблицаЗаявка.ТекущиеДанные;
	Если Не ТекущиеДанные.ДатаНачала = Дата(1, 1, 1) И Не ТекущиеДанные.ДатаОкончания = Дата(1, 1, 1) Тогда
		Если ТекущиеДанные.ДатаНачала > ТекущиеДанные.ДатаОкончания тогда
			Сообщить("Задан некорректный период: дата начала больше даты окончания!");
			ТекущиеДанные.ДатаНачала = Дата(1, 1, 1); 
			ТекущиеДанные.ДатаОкончания = Дата(1, 1, 1);
		ИначеЕсли ТекущиеДанные.ДатаОкончания < ТекущиеДанные.ДатаНачала тогда
			Сообщить("Задан некорректный период: дата окончания меньше чем дата начала!");
			ТекущиеДанные.ДатаНачала = Дата(1, 1, 1);
			ТекущиеДанные.ДатаОкончания = Дата(1, 1, 1);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция КнопкаДляПечатиНаСервере()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = Документы.Заявка.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заявка.Дата КАК Дата,
	|	Заявка.Номер КАК Номер,
	|	Заявка.Слушатель КАК Слушатель,
	|	Заявка.ТаблицаЗаявка.(
	|		Курс КАК Курс,
	|		ДатаНачала,
	|		ДатаОкончания 
	|	) КАК ТаблицаЗаявка
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|ГДЕ
	|	Заявка.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Объект.Ссылка);
	
	ПутьККомпоненте = "ОбщийМакет.Макет";
		
		Попытка
			Если ПодключитьВнешнююКомпоненту(ПутьККомпоненте, "Decl", ТипВнешнейКомпоненты.Native) Тогда
				НайденноеЗначение = Новый("AddIn.Decl.CNameDecl");
				Результат = НайденноеЗначение.Просклонять("Иванов Иван Иванович", 2);
			КонецЕсли;
			
		Исключение
			Сообщить("Не удалось загрузить внешнюю компаненту по причине: "+ОписаниеОшибки());
		КонецПопытки;
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблицаЗаявкаШапка = Макет.ПолучитьОбласть("ТаблицаЗаявкаШапка");
	ОбластьТаблицаЗаявка = Макет.ПолучитьОбласть("ТаблицаЗаявка");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабличныйДокумент.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
			
		Шапка.Параметры.Заполнить(Выборка);
		НайденноеЗначение = Новый("AddIn.Decl.CNameDecl");
		Шапка.Параметры.Слушатель = НайденноеЗначение.Просклонять(Объект.Слушатель.Наименование, 2);
		ТабличныйДокумент.Вывести(Шапка, Выборка.Уровень());
		
		ТабличныйДокумент.Вывести(ОбластьТаблицаЗаявкаШапка);
		ВыборкаТаблицаЗаявка = Выборка.ТаблицаЗаявка.Выбрать();
		Пока ВыборкаТаблицаЗаявка.Следующий() Цикл
			ОбластьТаблицаЗаявка.Параметры.Курс = ВыборкаТаблицаЗаявка.Курс;
			ОбластьТаблицаЗаявка.Параметры.ДатаНачала = Формат(ВыборкаТаблицаЗаявка.ДатаНачала, "ДФ=dd.MM.yyyy");
			ОбластьТаблицаЗаявка.Параметры.ДатаОкончания = Формат(ВыборкаТаблицаЗаявка.ДатаОкончания, "ДФ=dd.MM.yyyy");
			
			ТабличныйДокумент.Вывести(ОбластьТаблицаЗаявка, ВыборкаТаблицаЗаявка.Уровень());
		КонецЦикла;
		
		ПутьККомпоненте = "ОбщийМакет.Макет";
		
			
		Подвал.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	Возврат ТабличныйДокумент 	
	
КонецФункции

&НаКлиенте
Процедура КнопкаДляПечати(Команда)
	
	ТабличныйДокумент = КнопкаДляПечатиНаСервере();
	ТабличныйДокумент.Показать();
	
КонецПроцедуры

